public class Main {
    public static void main(String[] args) {

        int priceTicket = 1000;
        int money = 20;

        System.out.println("Премиальные мили составляют:  ");
        System.out.println(priceTicket / money);

        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}